app/views/plates/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
<div id ="show_profile_box">
	<%  @anv = User.find_by_id(@plate.user_id) %>