app/views/home/_feeds.html.erb

<%  @anv = User.find_by_id(feeds.user_id) %>
<%  @set = Setting.find_by_id(feeds.user_id) %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1