app/views/identities/_renderplate.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1
---
<%  @anv = User.find_by_id(renderplate.user_id) %>
<%  @set = Setting.find_by_id(renderplate.user_id) %>

SELECT "plates".* FROM "plates" WHERE "plates"."id" = ? LIMIT 1  [["id", 4]]
---
		<p class="linkstyle">
		<%= link_to Plate.find(renderplate.original_plate_id).name, showplate_identities_path(Plate.find(renderplate.original_plate_id))%>