app/views/searches/_fr.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "settings".* FROM "settings" WHERE "settings"."id" = 1 LIMIT 1
---
<%  @anv = User.find_by_id(fr.user_id) %>
<%  @set = Setting.find_by_id(fr.user_id) %>