app/controllers/feeds_controller.rb

  def new
    if current_user.blank?
      redirect_to sessions_path
    elsif current_user.plates.blank?
---
SELECT "plates".* FROM "plates" WHERE "plates"."user_id" = 2

  def create
    @feed = Feed.new(params[:feed])
    @feed.user_id = current_user.id

    #Feedzira!
    if @feed.url !=nil
      if !Cronfeed.where(:address => @feed.url).exists? && !Cronfeed.where(:feed_title => @feed.url).exists? && Feedzirra::Feed.fetch_and_parse(@feed.url) != 0
        @feedsFromAddress = Feedzirra::Feed.fetch_and_parse(@feed.url)
        #@urlFeedInfo = Domainatrix.parse(Feedzirra::Feed.fetch_and_parse(@feedsFromAddress.entries[0].url)
        @urlFeedInfo = Domainatrix.parse(@feedsFromAddress.entries[0].url)
        @urlToIcon = @urlFeedInfo.scheme + '://' + @urlFeedInfo.domain + '.' + @urlFeedInfo.public_suffix + '/favicon.ico'

        c = Cronfeed.create(:plate_id => @feed.original_plate_id, :address => @feed.url, :user_id =>current_user.id, :feedpic => @urlToIcon, :feed_title => @feedsFromAddress.title)
        c =  Cronfeedplaterelationship.create(:plate_id => @feed.original_plate_id, :cronfeed_id => c.id)
        Feed.update_from_feed_new(@feed.url, Plate.where(:id =>@feed.original_plate_id), @feedsFromAddress.title, @urlToIcon)
      elsif Cronfeed.where(:feed_title => @feed.url).exists?
---
SELECT "cronfeeds".* FROM "cronfeeds" WHERE "cronfeeds"."address" = 'http://rss.nytimes.com/services/xml/rss/nyt/Europe.xml' LIMIT 1
INSERT INTO "cronfeeds" ("address", "created_at", "plate_id", "updated_at") VALUES (?, ?, ?, ?)  [["address", "http://rss.nytimes.com/services/xml/rss/nyt/Europe.xml"], ["created_at", Sat, 20 Jul 2013 07:57:31 UTC +00:00], ["plate_id", 1], ["updated_at", Sat, 20 Jul 2013 07:57:31 UTC +00:00]]
INSERT INTO "feeds" ("content", "created_at", "down_votes", "guid", "language", "latitude", "location", "longitude", "original_plate_id", "published_at", "thumbnail_url", "title", "type_of_feed", "up_votes", "updated_at", "url", "url_to_feed", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
INSERT INTO "platerelationships" ("created_at", "feed_id", "plate_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 06:34:13 UTC +00:00], ["feed_id", 27], ["plate_id", 1], ["updated_at", Sat, 20 Jul 2013 06:34:13 UTC +00:00]]
SELECT "cronfeeds".* FROM "cronfeeds" WHERE "cronfeeds"."plate_id" = 3 LIMIT 1
SELECT "platerelationships".* FROM "platerelationships" WHERE "platerelationships"."plate_id" = 1 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT 1 AS one FROM "cronfeeds" WHERE "cronfeeds"."plate_id" = 4 AND "cronfeeds"."user_id" = 4 AND "cronfeeds"."address" = 'http://rss.nytimes.com/services/xml/rss/nyt/Europe.xml' LIMIT 1

        format.html { redirect_to user_path(current_user.id), notice: 'Feed was successfully created.' }
        format.json { render json: @feed, status: :created, location: @feed }
        if @feed.url != nil
           @feed.destroy
---
DELETE FROM "feeds" WHERE "feeds"."id" = ?  [["id", 52]]

  def add_feed
    if current_user.blank?
       redirect_to sessions_path
     elsif current_user.plates.blank?
---
SELECT "plates".* FROM "plates" WHERE "plates"."user_id" = 1

  def show
    @cpr = Cronfeedplaterelationship.new
    @feed = Feed.find(params[:id])
---
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = ? LIMIT 1  [["id", "add_url"]]