app/controllers/home_controller.rb

SELECT "feeds".* FROM "feeds" WHERE (location IS NOT NULL) ORDER BY created_at DESC
SELECT "feeds".* FROM "feeds" ORDER BY created_at DESC
---
  def index

	@link_feed_type = 'mostrecent'
  if params[:feed_type] == 'mostread'
    feed = mostviewed_cached
    @link_feed_type = 'mostread'
  elsif params[:feed_type] == nil || params[:feed_type] == 'mostrecent'
    feed = Feed.find(:all, :order => "created_at DESC")
    @link_feed_type = 'mostrecent'
  elsif params[:feed_type] == 'mostcommented'
    feed = Feed.find(:all, :order => "created_at DESC").sort_by { |feed| feed.comments.count }.reverse
    @link_feed_type = 'mostcommented'
  end
    @feeds = feed.paginate(:page => params[:page], :per_page => 14)