app/controllers/identities_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "settings".* FROM "settings" WHERE "settings"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "plates".* FROM "plates" INNER JOIN "userplaterelationships" ON "plates"."id" = "userplaterelationships"."secondaryplate_id" WHERE "userplaterelationships"."user_id" = 1
---
  def show
    @user = User.find(params[:id])
    @setting = Setting.find(params[:id])
    @plates = @user.plates
    @secondaryplates = @user.secondaryplates
    @friends = User.find(:all)

    #INFO from and to PARTIAL__________
    if params[:plates]!=nil
     @myp = params[:plates]
     else
     @myp = []
    end

    if params[:secondaryplates]!=nil
     @sp = params[:secondaryplates]
    else
     #@sp = @secondaryplates.collect(&:id)
     @sp = []
    end





    if params[:commit] == 'update'
     @startup = 0
     @allfeeds = getFeeds(@myp,@sp,@f)
    else
     @startup = 1
     @allfeeds = getFeedsStartup(@plates.collect(&:id),@secondaryplates.collect(&:id))