app/controllers/plates_controller.rb

     def create
       @plate = Plate.new(params[:plate])
       @plate.user_id = current_user.id

       respond_to do |format|
         if @plate.save
---
INSERT INTO "plates" ("created_at", "language", "location", "name", "public", "summmary", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

     def show
       @plate = Plate.find(params[:id])
---
SELECT "plates".* FROM "plates" WHERE "plates"."id" = ? LIMIT 1  [["id", "2"]]