app/controllers/searches_controller.rb

INSERT INTO "searches" ("created_at", "keywords", "language", "location", "searchall", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Sat, 20 Jul 2013 06:34:22 UTC +00:00], ["keywords", nil], ["language", nil], ["location", nil], ["searchall", "russia"], ["updated_at", Sat, 20 Jul 2013 06:34:22 UTC +00:00]]
---
  def create
    @search = Search.create!(params[:search])

SELECT "feeds".* FROM "feeds" WHERE (title LIKE '%russia%' OR content LIKE '%russia%' OR language LIKE '%russia%' OR location LIKE '%russia%') ORDER BY title
SELECT "searches".* FROM "searches" WHERE "searches"."id" = ? LIMIT 1  [["id", "11"]]
SELECT "users".* FROM "users" WHERE (name LIKE '%russia%') ORDER BY name
---
  def show
    @newsearch = Search.new
    @search = Search.find(params[:id]).feedresults
    if @search.nil?
      @search = @search
    else
      @search5 = @search.first(5)
    end
    @usersearch = Search.find(params[:id]).userresults